In [1]:
var = 'flesh wound'
s = "it's just a {}!"

s.format(var)

"it's just a flesh wound!"

In [2]:
s.format('scratch')

"it's just a scratch!"

In [7]:
s = """it's just a {},
       It's just a {}
    """
s.format('scratch', 'flesh wound')

"it's just a scratch,\n       It's just a flesh wound\n    "

In [8]:
s = """it's just a {1},
       It's just a {0}
    """
s.format('scratch', 'flesh wound')

"it's just a flesh wound,\n       It's just a scratch\n    "

In [9]:
s = "Hayden Planetarium Coordinates: {lat}, {lon}"
print(s.format(lat = '40.7315° N', lon='73.9733° W'))

Hayden Planetarium Coordinates: 40.7315° N, 73.9733° W

In [10]:
print('Some digits of pi: {}'.format(3.14159265359))

Some digits of pi: 3.14159265359

In [11]:
print("In 2005, Lu Chao of China recited {:,} digits of pi".format(67890))

In 2005, Lu Chao of China recited 67,890 digits of pi

In [30]:
print("I remember {0:.4} or {0:.4%} of what Lu Chao recited".format(7/67890)) # {0:.4} : 0을 제외한 숫자가 있는 부분을 4개 출력

I remember 0.0001031 or 0.0103% of what Lu Chao recited

In [23]:
print("My ID number is {0}")

In [24]:
print("My ID number is {0}".format(42))
print("My ID number is {0:5}".format(42))
print("My ID number is {0:05}".format(42))

My ID number is 42
My ID number is    42
My ID number is 00042

In [25]:
s = 'I only konw %d digits of pi' %7
s

'I only konw 7 digits of pi'

In [26]:
'Some digits of %(cont)s : %(value).2f' %{'cont': 'e', 'value': 2.718}

'Some digits of e : 2.72'

In [32]:
var = 'flesh wound'
s = f"It's just a {var}"
print(s)

It's just a flesh wound

In [33]:
lat='40.7815°N' 
lon='73.9733°W'

s = f'Hayden Planetarium Coordinates: {lat}, {lon}'
print(s)

Hayden Planetarium Coordinates: 40.7815°N, 73.9733°W

In [68]:
def my_sq(x):
    return x ** 2

In [69]:
def my_exp(x, n):
    return x ** n

In [70]:
my_sq(4)

16

In [71]:
my_exp(2,4)

16

In [38]:
import pandas as pd

In [72]:
df = pd.DataFrame({'a': [10, 20, 30], 'b': [20, 30, 40]})
df

    a   b
0  10  20
1  20  30
2  30  40

In [73]:
df['a']

0    10
1    20
2    30
Name: a, dtype: int64

In [74]:
df['a']**2

0    100
1    400
2    900
Name: a, dtype: int64

In [75]:
sq = df['a'].apply(my_sq)
sq

0    100
1    400
2    900
Name: a, dtype: int64

In [76]:
ex = df['a'].apply(my_exp, n = 2)
ex

0    100
1    400
2    900
Name: a, dtype: int64

In [77]:
ex = df['b'].apply(my_exp, n = 3)
ex

0     8000
1    27000
2    64000
Name: b, dtype: int64

In [78]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [79]:
def print_me(x):
    print(x)

In [84]:
df.apply(print_me, axis = 0)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [85]:
df.apply(print_me, axis = 1)

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64

0    None
1    None
2    None
dtype: object

In [86]:
def avg_2_apply(row): #행방향으로 적용
    sum = 0
    for item in row:
        sum += item
    return sum/df.shape[1]

In [ ]:
def avg_3_apply(col): #열방향으로 적용
    sum = 0
    for item in col:
        sum += item
    return sum/df.shape[0]

In [89]:
df.apply(avg_2_apply, axis = 1) #행방향으로 적용

0    15.0
1    25.0
2    35.0
dtype: float64

In [90]:
df.apply(avg_3_apply) #열방향으로 적용

a    20.0
b    30.0
dtype: float64

In [92]:
import seaborn as sns

In [93]:
titanic = sns.load_dataset("titanic")
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [105]:
import numpy as np

In [106]:
def count_missing(vec): #누락개수
    null_vec = pd.isnull(vec) #불린으로 true인 것만 가져옴
    null_count = np.sum(null_vec) #누락값 데이터를 합산
    return null_count

In [112]:
def prop_missing(vec): #누락비율
    num = count_missing(vec) #누락값의 갯수 가져오기
    dem = vec.size #전체 갯수
    return num / dem

In [113]:
def prop_complete(vec): #누락이 아닌 것들의 비율
    return 1 - prop_missing(vec)

In [114]:
cmis_col = titanic.apply(count_missing)
cmis_col

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [115]:
pmis_col = titanic.apply(prop_missing)
pmis_col

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [117]:
comp = titanic.apply(prop_complete)
comp

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [118]:
cmis_row = titanic.apply(count_missing, axis = 1) #누락개수
pmis_row = titanic.apply(prop_missing, axis = 1) #누락값 비율
pcom_row = titanic.apply(prop_complete, axis = 1) #누락값이 아닌 비율

In [120]:
cmis_row

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

In [121]:
pmis_row

0      0.066667
1      0.000000
2      0.066667
3      0.000000
4      0.066667
         ...
886    0.066667
887    0.000000
888    0.133333
889    0.000000
890    0.066667
Length: 891, dtype: float64

In [122]:
pcom_row

0      0.933333
1      1.000000
2      0.933333
3      1.000000
4      0.933333
         ...
886    0.933333
887    1.000000
888    0.866667
889    1.000000
890    0.933333
Length: 891, dtype: float64

In [123]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [124]:
titanic['num_missing'] = titanic.apply(count_missing, axis = 1)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1

In [126]:
titanic.loc[titanic.num_missing > 1, :]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,2
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True,2
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True,2
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True,2
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True,2
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False,2
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True,2
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,2
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,2

In [128]:
titanic.loc[titanic.num_missing > 1, :].sample(10) #10행만 랜덤하게 리턴

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
95,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2
552,0,3,male,NaN,0,0,7.8292,Q,Third,man,True,NaN,Queenstown,no,True,2
168,0,1,male,NaN,0,0,25.9250,S,First,man,True,NaN,Southampton,no,True,2
61,1,1,female,38.0,0,0,80.0000,NaN,First,woman,False,B,NaN,yes,True,2
451,0,3,male,NaN,1,0,19.9667,S,Third,man,True,NaN,Southampton,no,False,2
589,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2
264,0,3,female,NaN,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,no,True,2
481,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True,2
140,0,3,female,NaN,0,2,15.2458,C,Third,woman,False,NaN,Cherbourg,no,False,2
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True,2

In [129]:
df = pd.read_csv('data2/gapminder.tsv', sep = '\t') #tab으로 연결되어 있음을 알려줘야함
avg_iife_exp_by_year = df.groupby('year').lifeExp.mean() #groupby로 연도별로 분할해서, lifeExp의 연도별 평균값을 생성
avg_iife_exp_by_year

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [130]:
def my_mean(values):
    n = len(values)
    sum = 0
    for value in values:
        sum += value
        
    return sum/n

In [131]:
agg_my_mean = df.groupby('year').lifeExp.agg(my_mean) #사용자 정의 함수는 agg에 담아 사용해줘야함
agg_my_mean

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [137]:
#values의 평균을 구한다 -> lifeExp의 길이와 lifeExp의 값을 더하고 나누는 것
def my_mean_diff(values, diff_value): #열, 전체평균수명
    n = len(values)
    sum = 0
    for value in values:
        sum += value
    mean = sum/n
    return mean - diff_value

In [138]:
global_mean = df.lifeExp.mean()
global_mean

59.474439366197174

In [142]:
agg_mean_diff = df.groupby('year').lifeExp.agg(my_mean_diff, diff_value = global_mean) #diff_value= 생략 가능
agg_mean_diff #연도별 평균수명에서 전체평균수명을 뺀 값

year
1952   -10.416820
1957    -7.967038
1962    -5.865190
1967    -3.796150
1972    -1.827053
1977     0.095718
1982     2.058758
1987     3.738173
1992     4.685899
1997     5.540237
2002     6.220483
2007     7.532983
Name: lifeExp, dtype: float64

In [144]:
import numpy as np
gdf = df.groupby('year').lifeExp.agg([np.count_nonzero, np.mean, np.std]) #np.std : 
gdf

      count_nonzero       mean        std
year
1952          142.0  49.057620  12.225956
1957          142.0  51.507401  12.231286
1962          142.0  53.609249  12.097245
1967          142.0  55.678290  11.718858
1972          142.0  57.647386  11.381953
1977          142.0  59.570157  11.227229
1982          142.0  61.533197  10.770618
1987          142.0  63.212613  10.556285
1992          142.0  64.160338  11.227380
1997          142.0  65.014676  11.559439
2002          142.0  65.694923  12.279823
2007          142.0  67.007423  12.073021

In [146]:
gdf_dict = df.groupby('year').agg({'lifeExp':'mean', 'pop':'median', 'gdpPercap': 'median'}) #key값 : 직계 함수값
gdf_dict

        lifeExp         pop    gdpPercap
year
1952  49.057620   3943953.0  1968.528344
1957  51.507401   4282942.0  2173.220291
1962  53.609249   4686039.5  2335.439533
1967  55.678290   5170175.5  2678.334740
1972  57.647386   5877996.5  3339.129407
1977  59.570157   6404036.5  3798.609244
1982  61.533197   7007320.0  4216.228428
1987  63.212613   7774861.5  4280.300366
1992  64.160338   8688686.5  4386.085502
1997  65.014676   9735063.5  4781.825478
2002  65.694923  10372918.5  5319.804524
2007  67.007423  10517531.0  6124.371108

In [147]:
def my_zscore(x):
    return(x - x.mean())/x.std()

In [148]:
transform_z = df.groupby('year').lifeExp.transform(my_zscore) #lifeExp(파라메터)를 표준점수로 변환하겠다
transform_z # year별 lifeExp의 표준점수

0      -1.656854
1      -1.731249
2      -1.786543
3      -1.848157
4      -1.894173
          ...
1699   -0.081621
1700   -0.336974
1701   -1.574962
1702   -2.093346
1703   -1.948180
Name: lifeExp, Length: 1704, dtype: float64

In [150]:
df.shape, transform_z.shape

((1704, 6), (1704,))

In [152]:
import seaborn as sns

In [158]:
np.random.seed(42) #42는 42가 아니어도 됨(0이어도 되고 1이어도 되고 상관은 없음), 이렇게 설정하면 랜덤 값이 유지됨(시드 값을 갖고 요청하면 같은 값이 나옴)
tips_10 = sns.load_dataset('tips').sample(10)
tips_10 = tips_10.rename({'sex':'gender'}, axis = 'columns')
tips_10

     total_bill   tip  gender smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6          8.77  2.00    Male     No   Sun  Dinner     2
153       24.55  2.00    Male     No   Sun  Dinner     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4
198       13.00  2.00  Female    Yes  Thur   Lunch     2
176       17.89  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [159]:
tips_10.loc[np.random.permutation(tips_10.index)[:4], 'total_bill'] = np.NaN #인덱스 값의 0~3까지 가져와 섞은 뒤, total_bill에 NaN 할당
tips_10

     total_bill   tip  gender smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6          8.77  2.00    Male     No   Sun  Dinner     2
153         NaN  2.00    Male     No   Sun  Dinner     4
211         NaN  5.16    Male    Yes   Sat  Dinner     4
198         NaN  2.00  Female    Yes  Thur   Lunch     2
176         NaN  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [160]:
def fill_na_mean(x): #x는 성별이 구분된 total_bill 열의 값
    avg = x.mean()   #성별이 구분된 total_bill 열의 평균값
    return x.fillna(avg) #x가 NaN 값이면 avg 값을 채워준다

In [162]:
total_bill_group_mean = tips_10.groupby('gender').total_bill.transform(fill_na_mean) #gender로 구분한 total_bill의 데이터가 fill_na_mean의 값으로 넘겨짐
total_bill_group_mean #NaN값이 성별별로 평균의 값으로 채워짐

24     19.8200
6       8.7700
153    17.9525
211    17.9525
198    13.9300
176    17.9525
192    28.4400
124    12.4800
9      14.7800
101    15.3800
Name: total_bill, dtype: float64

In [163]:
tips_10['fill_total_bill'] = total_bill_group_mean #새로운 열의 이름에 넣어줌 (비교하기 위해)
tips_10

     total_bill   tip  gender smoker   day    time  size  fill_total_bill
24        19.82  3.18    Male     No   Sat  Dinner     2          19.8200
6          8.77  2.00    Male     No   Sun  Dinner     2           8.7700
153         NaN  2.00    Male     No   Sun  Dinner     4          17.9525
211         NaN  5.16    Male    Yes   Sat  Dinner     4          17.9525
198         NaN  2.00  Female    Yes  Thur   Lunch     2          13.9300
176         NaN  2.00    Male    Yes   Sun  Dinner     2          17.9525
192       28.44  2.56    Male    Yes  Thur   Lunch     2          28.4400
124       12.48  2.52  Female     No  Thur   Lunch     2          12.4800
9         14.78  3.23    Male     No   Sun  Dinner     2          14.7800
101       15.38  3.00  Female    Yes   Fri  Dinner     2          15.3800

In [166]:
tips = sns.load_dataset('tips')

In [167]:
tips.shape

(244, 7)

In [168]:
tips['size'].value_counts()

2    156
3     38
4     37
5      5
1      4
6      4
Name: size, dtype: int64

In [173]:
tips_filtered = tips.groupby('size').\
                filter(lambda x:x['size'].count() >= 30)
tips_filtered.head() #5, 1, 6에 대한 데이터는 없음

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [175]:
tips_filtered['size'].value_counts() #필터링된 결과

2    156
3     38
4     37
Name: size, dtype: int64

In [182]:
tips_10 = sns.load_dataset('tips').sample(10) #랜덤하게 10개의 행을 가져온다
tips_10 = tips_10.rename({'sex':'gender'}, axis = 'columns') #rename으로 열 이름을 바꾼다
tips_10

     total_bill   tip  gender smoker   day    time  size
198       13.00  2.00  Female    Yes  Thur   Lunch     2
171       15.81  3.16    Male    Yes   Sat  Dinner     2
209       12.76  2.23  Female    Yes   Sat  Dinner     2
185       20.69  5.00    Male     No   Sun  Dinner     5
206       26.59  3.41    Male    Yes   Sat  Dinner     3
168       10.59  1.61  Female    Yes   Sat  Dinner     2
222        8.58  1.92    Male    Yes   Fri   Lunch     1
214       28.17  6.50  Female    Yes   Sat  Dinner     3
84        15.98  2.03    Male     No  Thur   Lunch     2
33        20.69  2.45  Female     No   Sat  Dinner     4

In [183]:
grouped = tips_10.groupby('gender')
grouped #그룹객체 생성

In [184]:
grouped.groups

{'Male': [171, 185, 206, 222, 84], 'Female': [198, 209, 168, 214, 33]}

In [186]:
avgs = grouped.mean()
avgs

        total_bill    tip  size
gender
Male        17.530  3.104   2.6
Female      17.042  2.958   2.6

In [187]:
female = grouped.get_group('Female')
female

     total_bill   tip  gender smoker   day    time  size
198       13.00  2.00  Female    Yes  Thur   Lunch     2
209       12.76  2.23  Female    Yes   Sat  Dinner     2
168       10.59  1.61  Female    Yes   Sat  Dinner     2
214       28.17  6.50  Female    Yes   Sat  Dinner     3
33        20.69  2.45  Female     No   Sat  Dinner     4

In [188]:
for gender_group in grouped:
    print(gender_group)

('Male',      total_bill   tip gender smoker   day    time  size
171       15.81  3.16   Male    Yes   Sat  Dinner     2
185       20.69  5.00   Male     No   Sun  Dinner     5
206       26.59  3.41   Male    Yes   Sat  Dinner     3
222        8.58  1.92   Male    Yes   Fri   Lunch     1
84        15.98  2.03   Male     No  Thur   Lunch     2)
('Female',      total_bill   tip  gender smoker   day    time  size
198       13.00  2.00  Female    Yes  Thur   Lunch     2
209       12.76  2.23  Female    Yes   Sat  Dinner     2
168       10.59  1.61  Female    Yes   Sat  Dinner     2
214       28.17  6.50  Female    Yes   Sat  Dinner     3
33        20.69  2.45  Female     No   Sat  Dinner     4)

In [190]:
bill_gender_time = tips_10.groupby(['gender', 'time'])
group_avg = bill_gender_time.mean()
group_avg

               total_bill       tip      size
gender time
Male   Lunch      12.2800  1.975000  1.500000
       Dinner     21.0300  3.856667  3.333333
Female Lunch      13.0000  2.000000  2.000000
       Dinner     18.0525  3.197500  2.750000

In [191]:
type(group_avg)

pandas.core.frame.DataFrame

In [192]:
group_avg.columns

Index(['total_bill', 'tip', 'size'], dtype='object')

In [193]:
group_avg.index

MultiIndex([(  'Male',  'Lunch'),
            (  'Male', 'Dinner'),
            ('Female',  'Lunch'),
            ('Female', 'Dinner')],
           names=['gender', 'time'])

In [195]:
group_avg = group_avg.reset_index()
group_avg

   gender    time  total_bill       tip      size
0    Male   Lunch     12.2800  1.975000  1.500000
1    Male  Dinner     21.0300  3.856667  3.333333
2  Female   Lunch     13.0000  2.000000  2.000000
3  Female  Dinner     18.0525  3.197500  2.750000

In [196]:
group_avg2 = tips_10.groupby(['gender', 'time'], as_index = False).mean()
group_avg2

   gender    time  total_bill       tip      size
0    Male   Lunch     12.2800  1.975000  1.500000
1    Male  Dinner     21.0300  3.856667  3.333333
2  Female   Lunch     13.0000  2.000000  2.000000
3  Female  Dinner     18.0525  3.197500  2.750000

In [197]:
group_avg2 = tips_10.groupby(['gender', 'time']).mean().reset_index()
group_avg2

   gender    time  total_bill       tip      size
0    Male   Lunch     12.2800  1.975000  1.500000
1    Male  Dinner     21.0300  3.856667  3.333333
2  Female   Lunch     13.0000  2.000000  2.000000
3  Female  Dinner     18.0525  3.197500  2.750000